<!DOCTYPE html>
<html lang="en">
<head>
  <script>
  // 利用するSPARQLエンドポイントのURLを指定してください
  var endpoint = "http://ja.dbpedia.org/sparql";
  </script>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>SPARQLエンドポイント検索ページ</title>
  <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.0/css/bootstrap.min.css" integrity="sha384-9aIt2nRpC12Uk9gS9baDl411NQApFmC26EwAOH8WgZl5MYYxFfc+NcPb1dKGj7Sk" crossorigin="anonymous">
  <link href="https://cdn.jsdelivr.net/npm/vue-loading-overlay@3/dist/vue-loading.css" rel="stylesheet">
  <style>
    input, textarea {
      width: 100%;
    }
    .row {
      margin: 10px 0;
    }
    .btn-download {
      float: right;
      margin: 5px;
    }
  </style>
</head>
<body>

<div id="app" class="container">

  <div class="row">
    <div class="col-10">
      <h2>SPARQLエンドポイント検索ページ</h2>
    </div>
    <div class="col-2">
      <button class="btn btn-outline-dark btn-download"
        @click.prevent="downloadData" 
        :disabled="!results.data">
        <svg width="20px" height="20px" viewBox="0 0 16 16" class="bi bi-download" fill="currentColor" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" d="M.5 8a.5.5 0 0 1 .5.5V12a1 1 0 0 0 1 1h12a1 1 0 0 0 1-1V8.5a.5.5 0 0 1 1 0V12a2 2 0 0 1-2 2H2a2 2 0 0 1-2-2V8.5A.5.5 0 0 1 .5 8z"/>
          <path fill-rule="evenodd" d="M5 7.5a.5.5 0 0 1 .707 0L8 9.793 10.293 7.5a.5.5 0 1 1 .707.707l-2.646 2.647a.5.5 0 0 1-.708 0L5 8.207A.5.5 0 0 1 5 7.5z"/>
          <path fill-rule="evenodd" d="M8 1a.5.5 0 0 1 .5.5v8a.5.5 0 0 1-1 0v-8A.5.5 0 0 1 8 1z"/>
        </svg>
      </button>
    </div>
  </div>

  <div class="row">
    <div class="col-12">
      <textarea v-model="query" rows="10"></textarea>
    </div>
  </div>

  <div class="row">
    <div class="col-12">
      <input @click.stop.prevent="doSearch"
        type="button" 
        class="btn btn-primary"
        value="検索" />
    </div>
  </div>

  <div class="row">
    <div class="col-12">
      <table class="table" v-if="results.head.length>0">
        <thead>
          <tr>
            <th v-for="value in results.head">
              {{ value }}
            </th>
          </tr>
        </thead>
        <tbody>
          <tr v-for="data in results.body">
            <td v-for="value in data">
              {{ value }}
            </td>
          </tr>
        </tbody>
      </table>
    </div>
  </div>
  
</div>
<script src="https://cdn.jsdelivr.net/npm/vue"></script>
<script src="https://cdn.jsdelivr.net/npm/vue-loading-overlay@3"></script>
<script src="https://cdn.jsdelivr.net/npm/axios/dist/axios.min.js"></script>
<script>
Vue.use(VueLoading);
Vue.component('loading', VueLoading);

var app = new Vue({
  el: '#app',
  data: {
    query: 'select * where {?s ?p ?o} LIMIT 10',
    results: {
      data: null,
      head: [],
      body: [],
    },
  },
  methods: {
    doSearch: function() {
      var loader = this.$loading.show();
      var that = this;
      axios.get(
        endpoint+"?query="+encodeURIComponent(this.query),
        { headers: {'Accept': 'application/sparql-results+json'} })
      .then(function(res) {
        that.results.data = res.data;
        that.results.head = res.data.head.vars;
        that.results.body = [];
        for (const d of res.data.results.bindings) {
          var obj = [];
          for (const l of that.results.head) {
            if (l in d && d[l].value) obj.push(d[l].value);
            else obj.push("");
          }
          that.results.body.push(obj);
        }
      })
      .catch(function(error) {
        console.log(error);
        alert("Error!");
      })
      .then(function() {
        loader.hide();
      });
    },
    downloadData: function() {
      var filename = "results.json";
      var a = document.createElement('a');
      var uriContent = 'data:application/octet-stream,'+encodeURIComponent(JSON.stringify(this.results.data));
      a.setAttribute('href', uriContent);
      a.setAttribute('download', filename);
      document.body.appendChild(a);
      a.click();
      document.body.removeChild(a);
    }
  }
})
</script>
</body>
</html>